garyPenhook/PyAvrOCD/svd/avr32eb14.svd
        <register>
          <name>MUXNEG</name>
          <description>Negative Input Multiplexer</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXNEG</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN28</name>
                  <description>ADC input pin 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN29</name>
                  <description>ADC input pin 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN30</name>
                  <description>ADC input pin 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN31</name>
                  <description>ADC input pin 31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>Digital to Analog Converter 0</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF0</name>
                  <description>AC0 DAC reference</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF1</name>
                  <description>AC1 DAC reference</description>
                  <value>58</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VIA</name>
              <description>VIA</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>Inputs connected directly to ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>Inputs connected via PGA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUXPOS</name>
          <description>Positive Input Multiplexer</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN28</name>
                  <description>ADC input pin 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN29</name>
                  <description>ADC input pin 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN30</name>
                  <description>ADC input pin 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN31</name>
                  <description>ADC input pin 31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD10</name>
                  <description>VDD Divided by 10</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature Sensor</description>
                  <value>50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VIA</name>
              <description>VIA</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>Inputs connected directly to ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>Inputs connected via PGA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL</name>
          <description>PGA Control</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGAEN</name>
              <description>PGA Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGABIASSEL</name>
              <description>PGA BIAS Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>100PCT</name>
                  <description>100% BIAS current.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>75PCT</name>
                  <description>75% BIAS current. Usable for CLK_ADC&lt;4.5MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50PCT</name>
                  <description>50% BIAS current. Usable for CLK_ADC&lt;3MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25PCT</name>
                  <description>25% BIAS current. Usable for CLK_ADC&lt;1.5MHz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1X</name>
                  <description>1x gain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2x gain</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4x gain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8x gain</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16x gain</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>4294967295</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>Sample</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP0</name>
          <description>Temporary Data 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMP1</name>
          <description>Temporary Data 1</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMP2</name>
          <description>Temporary Data 2</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>WINHT</name>
          <description>Window High Threshold</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Low Threshold</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
