garyPenhook/PyAvrOCD/svd/avr32eb14.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WEX0</name>
      <description>Waveform Extension</description>
      <baseAddress>0x00800C80</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x12</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x17</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BLANKCTRL</name>
          <description>Blanking Control</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLANKTRIG</name>
              <description>Blanking Trigger</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No HW trigger (Software only)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0UPD</name>
                  <description>TCE0 Update Condition</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0CMP0</name>
                  <description>TCE0 Compare 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0CMP1</name>
                  <description>TCE0 Compare 1</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0CMP2</name>
                  <description>TCE0 Compare 2</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0CMP3</name>
                  <description>TCE0 Compare 3</description>
                  <value>20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKPRESC</name>
              <description>Blanking Prescaler</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>No prescaling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide CLK_PER by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide CLK_PER by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide CLK_PER by 64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLANKTIME</name>
          <description>Blanking Time</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>BUFCTRL</name>
          <description>Buffer Valid Control</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTLSBV</name>
              <description>Dead-time Low Side Buffer Valid</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHSBV</name>
              <description>Dead-time High Side Buffer Valid</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPBV</name>
              <description>Swap Buffer Valid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOVRBV</name>
              <description>PGM Override Buffer Valid</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMOUTBV</name>
              <description>PGM Output Value Buffer Valid</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTI0EN</name>
              <description>Dead-Time Insertion CMP0 Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTI1EN</name>
              <description>Dead-Time Insertion CMP1 Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTI2EN</name>
              <description>Dead-Time Insertion CMP2 Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTI3EN</name>
              <description>Dead-Time Insertion CMP3 Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INMX</name>
              <description>Input Matrix</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>Direct from TCE0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CWCMA</name>
                  <description>Common Waveform Channel Mode A. Single WO</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CWCMB</name>
                  <description>Common Waveform Channel Mode B. WO from two PWM channels</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGM</name>
              <description>Pattern Generation Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPDSRC</name>
              <description>Update Source</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM0</name>
                  <description>Timer/Counter for PWM 0 update condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software update only. No hardware update condition</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force update of Dead-time, SWAP and PGM buffer registers.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTSET</name>
                  <description>Set Fault Detection</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTCLR</name>
                  <description>Clear Fault Detection</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLANKSET</name>
                  <description>Set SW Blanking</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLANKCLR</name>
                  <description>Clear SW Blanking</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTBOTH</name>
          <description>Dead-time Both Sides</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DTBOTHBUF</name>
          <description>Dead-time Both Sides Buffer</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DTHS</name>
          <description>Dead-time High Side</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DTHSBUF</name>
          <description>Dead-time High Side Buffer</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DTLS</name>
          <description>Dead-time Low Side</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DTLSBUF</name>
          <description>Dead-time Low Side Buffer</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EVCTRLA</name>
          <description>Event Control A</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTEI</name>
              <description>Fault Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault Event Blanking Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>Fault Event Filter Enable</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>No digital filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE1</name>
                  <description>One Sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE2</name>
                  <description>Two Samples</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE3</name>
                  <description>Three Samples</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE4</name>
                  <description>Four Samples</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE5</name>
                  <description>Five Samples</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE6</name>
                  <description>Six Samples</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE7</name>
                  <description>Seven Samples</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRLB</name>
          <description>Event Control B</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTEI</name>
              <description>Fault Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault Event Blanking Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>Fault Event Filter Enable</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>No digital filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE1</name>
                  <description>One Sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE2</name>
                  <description>Two Samples</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE3</name>
                  <description>Three Samples</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE4</name>
                  <description>Four Samples</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE5</name>
                  <description>Five Samples</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE6</name>
                  <description>Six Samples</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE7</name>
                  <description>Seven Samples</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRLC</name>
          <description>Event Control C</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAULTEI</name>
              <description>Fault Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault Event Blanking Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>Fault Event Filter Enable</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>No digital filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE1</name>
                  <description>One Sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE2</name>
                  <description>Two Samples</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE3</name>
                  <description>Three Samples</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE4</name>
                  <description>Four Samples</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE5</name>
                  <description>Five Samples</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE6</name>
                  <description>Six Samples</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE7</name>
                  <description>Seven Samples</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
